vageeshgaonkar1-git/Vehicle_Emission_Monitor_Embedded/stm32/main.c
    uint32_t timeout = 200;
    while (dht22_read_bit() == 1) { delay_us(1); if (--timeout == 0) return HAL_ERROR; }
    timeout = 200;
    while (dht22_read_bit() == 0) { delay_us(1); if (--timeout == 0) return HAL_ERROR; }
    timeout = 200;
    while (dht22_read_bit() == 1) { delay_us(1); if (--timeout == 0) return HAL_ERROR; }

    for (int i = 0; i < 40; i++) {
        timeout = 200;
        while (dht22_read_bit() == 0) { delay_us(1); if (--timeout == 0) return HAL_ERROR; }
        delay_us(35);
        uint8_t bit = dht22_read_bit();
        data[i / 8] = (uint8_t)((data[i / 8] << 1) | bit);
        timeout = 200;
        while (dht22_read_bit() == 1) { delay_us(1); if (--timeout == 0) return HAL_ERROR; }
    }

    uint8_t sum = data[0] + data[1] + data[2] + data[3];
    if (sum != data[4]) return HAL_ERROR;

    *humidity    = ((data[0] << 8) | data[1]) * 0.1f;
    int16_t raw_t = (int16_t)(((data[2] & 0x7F) << 8) | data[3]);
    if (data[2] & 0x80) raw_t = -raw_t;
    *temperature = raw_t * 0.1f;

    return HAL_OK;
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  ADC helper
 * ═══════════════════════════════════════════════════════════════════════════ */
static uint16_t adc_read_channel(uint32_t channel)
{
    ADC_ChannelConfTypeDef cfg = {0};
    cfg.Channel      = channel;
    cfg.Rank         = 1;
    cfg.SamplingTime = ADC_SAMPLETIME_84CYCLES;
    HAL_ADC_ConfigChannel(&hadc1, &cfg);

    HAL_ADC_Start(&hadc1);
    HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY);
    uint16_t val = (uint16_t)HAL_ADC_GetValue(&hadc1);
    HAL_ADC_Stop(&hadc1);
    return val;
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  MQ-7 CO sensor — corrected R0 calibration + EMA-smoothed PPM
 *
 *  Datasheet clarification:
 *    R0 is defined as the sensor resistance AT 100 ppm CO, not in clean air.
 *    In clean air (continuous 5V mode) the ratio Rs/R0 = 9.83, so:
 *        R0 = Rs_clean_air / MQ7_CLEAN_AIR_RATIO
 *    calibrate_mq7_baseline() measures Rs_clean, divides by 9.83, and stores
 *    the result as MQ7_R0 — the value that makes the power-law curve correct.
 *
 *  mq7_read_ppm():
 *    Converts a raw 12-bit ADC value to CO ppm using the power-law curve:
 *        ppm = 99.042 × (Rs / R0)^−1.518
 *    An Exponential Moving Average (α = 0.1) suppresses thermal jitter.
 *    In clean air the ratio Rs/R0 ≈ 9.83 → ~10 ppm, which the dashboard
 *    deadband filter already clamps to 0 for a stable display.
 *
 *  Circuit assumptions:
 *    • MQ-7 VCC = 3.3 V (same as STM32 ADC reference)
 *    • Load resistor RL = 10 kΩ (MQ7_RL)
 *    • ADC reads voltage across RL
 * ═══════════════════════════════════════════════════════════════════════════ */

/**
 * Establish the MQ-7 R0 baseline (resistance at 100 ppm CO).
 * Samples clean-air Rs over ~5 s, then divides by MQ7_CLEAN_AIR_RATIO (9.83)
 * to obtain the datasheet-correct R0.
 */
static void calibrate_mq7_baseline(void)
{
    printf("Calibrating MQ-7. Ensure sensor is in clean air...\n");
    float rs_sum = 0.0f;
    int   valid  = 0;

    for (int i = 0; i < 50; i++) {
        uint32_t raw_adc = adc_read_channel(ADC_CHANNEL_0);
        float voltage = ((float)raw_adc / 4095.0f) * MQ7_V_SUPPLY;
        if (voltage > 0.01f) {
            float rs  = MQ7_RL * (MQ7_V_SUPPLY - voltage) / voltage;
            rs_sum   += rs;
            valid++;
        }
        HAL_Delay(100);   /* 100 ms × 50 = 5 seconds */
    }

    if (valid > 0) {
        float rs_clean_air = rs_sum / (float)valid;

        /* Divide clean-air Rs by the clean-air ratio to get true R0 @ 100 ppm */
        MQ7_R0 = rs_clean_air / MQ7_CLEAN_AIR_RATIO;

        /* Safety clamp — implausible result means sensor is absent/saturated */
        if (MQ7_R0 <= 0.1f) MQ7_R0 = 1.5f;

        printf("MQ-7 calibration complete. Rs_clean = %.2f kOhm -> R0 = %.2f kOhm\n",
               rs_clean_air, MQ7_R0);
    } else {
        printf("MQ-7 calibration failed (no valid ADC readings). Using R0 = %.2f kOhm\n",
               MQ7_R0);
    }
}

/**
 * Read CO concentration in ppm from the MQ-7 sensor.
 * Applies an EMA (α = 0.1) to suppress thermal jitter.
 */
static float mq7_read_ppm(uint16_t raw_adc)
{
    static float smoothed_ppm = 0.0f;   /* EMA state — persists across calls */

    float voltage = ((float)raw_adc / 4095.0f) * MQ7_V_SUPPLY;

    if (voltage <= 0.01f) return smoothed_ppm;   /* sensor open / shorted */

    if (voltage > MQ7_V_SUPPLY - 0.01f) voltage = MQ7_V_SUPPLY - 0.01f;

    float rs    = MQ7_RL * (MQ7_V_SUPPLY - voltage) / voltage;
    float ratio = rs / MQ7_R0;   /* ≈ 9.83 in clean air — correct by design */

    /* MQ-7 power-law curve: ppm = 99.042 × (Rs/R0)^−1.518 */
    float raw_ppm = 99.042f * powf(ratio, -1.518f);

    if (raw_ppm < 0.0f)    raw_ppm = 0.0f;
    if (raw_ppm > 2000.0f) raw_ppm = 2000.0f;

    /* Exponential Moving Average: α = 0.1 → smooth, lag-tolerant output */
    smoothed_ppm = (0.1f * raw_ppm) + (0.9f * smoothed_ppm);

    return smoothed_ppm;
}

static float mq135_read_ppm(uint16_t raw_adc, float temperature, float humidity)
{
    const float V_ADC_FS = 3.3f;
    const float V_MAX    = 4095.0f;
    const float V_SUPPLY = 5.0f;
    const float R_LOAD   = 10.0f;

    /* YOUR NEW CALIBRATED BASELINE */
    const float R0       = 5.847f;

    float vout = ((float)raw_adc / V_MAX) * V_ADC_FS;
    if (vout < 0.01f) vout = 0.01f;
    if (vout > V_SUPPLY - 0.01f) vout = V_SUPPLY - 0.01f;

    float rs = R_LOAD * (V_SUPPLY - vout) / vout;

    /* Convert Resistance to PPM using datasheet power curve */
    float ratio = rs / R0;
    float ppm = 116.6f * powf(ratio, -2.769f);

    if (ppm < 0.0f)   ppm = 0.0f;
    if (ppm > 500.0f) ppm = 500.0f;

    return ppm;
}

/* Legacy wrapper — kept so existing call sites compile without change */
float dht22_correct_gas(uint16_t raw_adc, float temperature, float humidity)
{
    /* Default to MQ-135 behaviour when called generically */
    return mq135_read_ppm(raw_adc, temperature, humidity);
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  MPU6050 — vibration detection — Requirement 13.5
 *
 *  Strategy: delta-from-baseline rather than absolute magnitude.
 *
 *  At rest, gravity (~16384 LSB on one axis in ±2 g range) dominates the
 *  raw readings.  Comparing raw magnitude against a fixed threshold always
 *  fires because gravity alone exceeds any reasonable value.
 *
 *  Instead:
 *    1. mpu6050_calibrate() samples BASELINE_SAMPLES readings at startup
 *       (engine off, board stationary) and stores the average as the baseline.
 *    2. mpu6050_is_running() computes the Euclidean distance between the
 *       current reading and the baseline.  A distance > VIBRATION_THRESHOLD
 *       means the board is experiencing extra acceleration → engine running.
 * ═══════════════════════════════════════════════════════════════════════════ */

/**
 * Read one raw accelerometer sample from MPU6050.
 * Returns HAL_OK and fills ax/ay/az on success.
 */
static HAL_StatusTypeDef mpu6050_read_accel(int16_t *ax, int16_t *ay, int16_t *az)
{
    uint8_t buf[6];
    HAL_StatusTypeDef status = HAL_I2C_Mem_Read(
        &hi2c1, MPU6050_ADDR, MPU6050_REG_ACCEL_XOUT,
        I2C_MEMADD_SIZE_8BIT, buf, 6, 50);

    if (status != HAL_OK) return HAL_ERROR;

